# 一个获取键盘上输入信息并记录的语句,重要的东西
# input(提示信息),与前面的变量结合并输出可以获取键盘输入的数据 (s = input(提示信息))
# print(数据...)用于将输入的信息提取出来,输出到控制台
# 案例,一个取款的并计算剩余存款,输入密码,输入提取金额,计算余额并输出,总额1W,取钱完毕后展示银行卡余额
# 总额为1W,一开始的余额为一万
# ze = 10000
# # 银行卡输入密码界面
# mn = input("请输入您的银行卡密码: ")
# print(f"密码正确,您的密码为 {mn}")
#
# # 取的银行卡金额
# ye = input("请输入您要取的金额: ")
# print(f"您要提现的金额为 {ye}")
#
# # 最后计算的余额并输出(括号中可以写表达式)
# print(f"您当前剩余金额为 {ze - int(ye)} ")
# 发现ye为字符串类型,进行更改ye 转为int类型 int()
# 其他类型转换同 int() str() float() bool()

# 计算两个数字之和,并输出到控制台
# 输入第一个
a1 = input("这是一个加法计算器,请输入您的第一位数字: ")

# 输入第二位密码
a2 = input(f"请输入与 {a1} 相加的数字: ")
# 最后一步输出结果
print(f"计算结果为: {int(a1) + int (a2)}")