# 1:算术运算符
# 加减乘除,多个整除,取余/求模,幂指数
# 乘(*) 幂(**) 除(/) 整除(//) 取余/求模(%)求余就是求出余数(除法10/3余1)
#算术运算符优先级 ---->幂(**)＞* / // % ＞ + -

# 案例:要求输入两个数x y ,分别输出x+y,x-y的结果
# 先输入x y
# X = input("请输入你想要加减的第一位数: ")
# # Y = input("请输入你想要加减的第二位数: ")
# #
# # # 接下来计算他们的相加和减
# # print(f" X + Y 的结果为: ", int(X) + int(Y) )
# # print(f" X - Y 的结果为: ", int(X) - int(Y) )
# 发现这样子无法计算小数点的运算，通过改进改进为float()

# X = float(input("请输入你想要加减的第一位数: "))
# Y = float(input("请输入你想要加减的第二位数: "))
#
# print(f" X + Y 的结果为: ", X + Y)
# print(f" X - Y 的结果为: ", X - Y )
# 计算结果会发现减法的结果为0.09999999999999998
# 这是由于计算机的精度损失，由于计算机的底层是基于二进制来进行数据的存储和处理的，而二进制无法准确表示所有小数，因此涉及到浮点数运算时，可能损失精度
# 应该后面就会教我怎么把损失的精度补回来

# 案例1：计算输入三个整数的平均数
# 案例二，要求输入梯形的上底，下底，高，然后计算梯形的面积
# 案例三：要求输入圆的半径，然后计算圆的周长和面积
# 案例4：身高质量指数BMI的计算

# 案例1：计算输入三个整数的平均数
# 1 先输入三个整数
# X = int(input("请输入你的第一位数: "))
# Y = int(input("请输入你的第二位数: "))
# Z = int(input("请输入你的第三位数: "))
# 接下来输出结果
# print((X + Y + Z) / 3)
# 代码能跑通，接下来试试ds教的拓展知识 map（） 映射 与 .split() 用空格把文字切开
# X, Y, Z = map(int,(input("请输入您想输入的三位数字并用空格隔开： ").split()))# 错误点就是,我还是老思维喜欢只输入一个代码然后连着
# 我应该做的是把我的代码分开然后连起来,比如int,input(),而不是int(input()),这样子只会int一个数字而不是括号内所有数字
# int()能力有限,一次只能转一串字符串,而我输入了三个,所以我要将我的三个字符串打包成一个再进行int()操作
# 接下来输出结果
# print("您输入的整数算出来的平均数为: ",(X + Y + Z) / 3)

# 案例二，要求输入梯形的上底，下底，高，然后计算梯形的面积
# 1:先输入数据,上底,下底,高
# X, Y, Z = map(float,(input("请按顺序输入梯形的上底,下底(用空格隔开): ").split()))
# # 2:输出梯形的面积
# print(f"梯形的面积为: {(X + Y) * Z / 2}")

# 案例三：要求输入圆的半径，然后计算圆的周长和面积
# 第一步输入半径
# r = float(input("请输入圆的半径: "))
# 第二步输出周长与面积
# print(f"圆的周长为: {2 * r}Π")
# print(f"圆的面积为: {r ** 2 }Π")

# 案例4：身高质量指数BMI的计算
# 1：输入身高体重
# X, Y = map(float,(input("请依次输入您的身高(m)以及体重(Kg): ").split()))
# # 2:输出bmi
# print(f"您的身高体重为: {Y / X ** 2}")

# 赋值运算符 加减乘除 % // **
# 赋值运算符,给一个初始的值,然后就会开始运算,例如num = 100
# num += 100 = num + 100 (等等案例)不一一举例
# 这样子多几个 -=, /=就会依次进行运算,
# 注意,如果被除,那么整数就会变成 小数/浮点数 会多小数点

# 比较运算符 ----->输出结果输出布尔(bool)值 True false
# ==
# != (判断是否不等于)
# >
# >=
# <
# <=

# 逻辑运算符
# and , or , not(取反)(True改false false改Ture)
# 逻辑运算符就是用来连接我们的条件,并返回一个最终布尔值的运算符

# 需求1:键盘输入一个整数,判断这个数是否在10 - 20 之间
# 需求2:键盘输入一个整数,判断这个数是否不在10 - 20 之间

# 需求1:键盘输入一个整数,判断这个数是否在10 - 20 之间
# 1 先输入一个数
# num = int(input("请输入一个数,让我判断是否在 10 - 20 之间: "))
# 2 判断
# print("结果为: ",num >= 10 and num <= 20)

# 需求2:键盘输入一个整数,判断这个数是否不在10 - 20 之间
# 1 输入数字
num = int(input("请输入一个数,让我判断是否不在 10 - 20 之间: "))
# 2 判断
print("结果为: ",num <= 10 or num >= 20)
