# 如果分数大于680分,我就上清华
# num = 600
# #判断能不能上
# if num >= 680:
#     print("欢迎你来到清华")
#     print("请问你还有什么想问的吗")

#结合所学,完成B站登录功能的实现(账号1888 密码666888)
# 1 先输入账号和密码
# zh = int(input("请输入你的账号: "))
# mm = int(input("请输入你的密码: "))
# # 判断账号与密码是否正确,if语句实战
# if zh == 1888 and mm == 666888:
#     print("欢迎你,尊贵的B站亲爹")
# if zh != 1888 or mm != 666888:
#     print("滚出去,你不是我们B站的亲爹")


# if语句进阶其一
# 用if...else...(如果不是1立马执行2)
# zh = int(input("请输入你的账号: "))
# mm = int(input("请输入你的密码: "))
#
# if zh == 1888 and mm == 666888:
#     print("欢迎你,尊贵的B站亲爹")
# else:
#     print("滚出去,你不是我们B站的亲爹")

# 案例 根据用户输入的年份,判断这一年是闰年还是平年
# 非整百年份,能被4整除的年份是闰年,否则就是平年
# 整百年份,必须能被400整除的年份才是闰年,否则就是平年
# 1 先输入年份
# NF = int(input("请输入你想判断闰年的年份: "))
# 2 判断是否为整百
# if NF % 100 == 0:
#     if  NF % 400 == 0:
#         print(f" {NF} 年为闰年")
#     else:
#         print(f" {NF} 年为平年")
# # 3 判断完成后再观察是不是闰年
# else:
#     if NF % 4 == 0:
#         print(f" {NF} 年为闰年")
#     else:
#         print(f" {NF} 年为平年")

# 需求1 根据用户输入的数字判断奇数偶数
# 1 先输入数字
# JO = int(input("请输入想要判断奇偶的数字: "))
# # 2 判断奇偶
# if JO % 2 == 0:
#     print(f"{JO}是偶数")
# else:
#     print(f"{JO}是奇数")

# 需求2 根据用户输入的年龄判断是否成年
# 1 输入年龄
# year = int(input("请输入你的年龄: "))
# #  2 判断未成年
# if year >= 18:
#     print(f"恭喜你,你成年了")
# else:
#     print(f"去你妈的未成年")

# 需求3 根据用户输入的数字判断该数字是正数还是负数（不考虑0）
# 1 输入
# num = float(input("请输入你想判断正负的数字: "))
# # 2 判断
# if num < 0:
#     print(f"{num}是负数")
# elif num > 0:
#     print(f"{num}是正数")
# else:
#     print(f"{num}是0")

# 需求4 根据用户输入的考试分数，判断用户是否及格
# 1 输入考试分数
# FS = float(input("请输入你的考试分数: "))
# # 2 判断是否及格
# if FS >= 60:
#     print("恭喜你及格了")
# else:
#     print(f"去你妈的才考{FS},回去重修")

# 三角形类型判断
# 1 输入三边边长
# A, B, C = map(float,input("请分别输入三角形三条边的边长(并用空格隔开): ").split())
# # 2 判断是不是三角形,两边之差小于第三边,两边之和大于第三边
# if A - B < C and A + B > C and B + C > A:
#     # 是三角形的话,是什么三角形
#     if A == B == C:
#         print("这个三角形是等边三角形")
#     elif A == B or A == C or B == C:
#         print("这个三角形是等腰三角形")
#     else:
#         print("这个三角形是普通三角形")
#
# # 不是的话
# else:
#     print("这不是三角形")

# 计算年度用电电费,根据度数来排行
# 1 输入今年的用电度数
# DS = float(input("请输入你今年的用电度数: "))
# # 分三类, 2880 < , 2880 <= DS <= 4800 , DS >= 4800
# # 第一档
# if DS < 2880:
#     print(f"您今年用电 {DS} 度,需交付电费 {DS * 0.48883:.2f} 元")
# elif 2880 <= DS <= 4800:
#     print(f"您今年用电 {DS} 度,需交付电费 {DS * 0.5383:.2f} 元")
# else:
#     print(f"您今年用电 {DS} 度,需交付电费 {DS * 0.7883:.2f} 元")
