#  for 循环,本质是一种轮询遍历机制,对 一批内容 进行 逐个处理
#  for 元素 in 待处理数据集:
#      循环体代码(对元素进行处理)
#  else:
#       循环结束时,执行的代码
# 我自己的理解是,while 循环可以用来处理简单便捷的除了对就是错的循环
# for 可以方便的检查数据库中的每一个元素,结合while循环,找到自己想要的元素
# 结合运算符 and , or 以及for + while 的搜索摆出结果,搜索列表的符合元素的结合

# 案例 1 计算 1 - 100 之间所有奇数的和
# for循环可以检索集合中所有的元素,我分为创建一个 1 - 100 的集合 ,for 循环检索 ,再相加
#  1 创建 1- 100 的集合 我的所学只能让我想到用while 循环创建
# he = 0
#
# # 创建好了一个while循环集合之后,用我所学的for 循环尝试求和
# for i in range(1,100,2):# 检索集合中的数字一个一个来
#     he += i
# else:
#     print(f"{he}")
# 额外拓展(sum 求和代码,自动求和所有的数)
# print(sum(range(1,100,2),))

# 案例2 计算所有 100 - 500 之间所有 3 的倍数数字之和
# 和之前一样,先创建一个集合,不过不去搞的那么麻烦了,直接用range
# he = 0
# for i in range(100,500,1):
#     if i % 3 == 0:
#         he += i
# print(he)





