# 需求 造一个B站的登录界面
# 1. 正确的用户名和密码为admin/666888 、zhangsan/123456、ta0ge/888666   (1 2 可以同时进行)
cw = 0

# 2.输入用户名和密码进行登录，直到登录成功，程序结束运行;如果登录失败，则继续输入用户名和密码进行登录
while True:
    zh = input("请输入你的账号: ")
    mm = input("请输入你的密码: ")
    # # 3.输入的用户名和密码不能为空!
    if zh == "" or mm == "":
        print("输入的用户名和密码不能为空!")
        cw += 1
        continue# 接下来的代码不用看了,直接开始下一个循环

         # 4.登录成功:输出"登录成功，进入B站首页~"
    if (zh == "admin" and mm == "666888") or (zh == "zhangsan" and mm == "123456") or (zh == "ta0ge" and mm == "888666"):
        print("登录成功，进入B站首页~")
        break# 登录成功了还输牛魔的账号密码呢,代码运行结束了,while for 循环已经结束了,后面的代码也不会运行了
        # 5.登录失败:输出"用户名或密码错误，请重新输入!"
    else:
        print("用户名或密码错误，请重新输入!")
        cw += 1
    if cw < 5:
        continue
    else:
        print("抱歉,您的账号或密码不通过5次,请稍后再输入")
        break


# 现在多一个条件,要求输入五次之后就不再允许输入了





