# 数据容器 列表(list)
# s = [1, 2, 3, 4...]
# 特点
#  可以存储不同类型元素
#  元素有序,可以重复,元素可以修改
# 索引从 s0 开始获取,还有反向索引,从s-1,s-2开始(从倒数第一开始)
# 查看
#   s[0]
# 修改
#     s[0] = ?
# 删除
#     del s[0]
# 指定/索引的范围不能超出列表的范围
from operator import ifloordiv

# 列表的切片 语法 序列数据[开始索引:结束索引:步长]
# s = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

# 切片操作 s[开始索引:结束索引:步长] (切片不会包含结束索引)步长默认为1,开始默认为0,结束也可以反向索引
# print(s[:5])

# 方法,指的就是对象中提供的功能,比如手机(对象)的功能 打电话(方法) 发短信(方法)
# 列表的常见方法 (加 减 排序)
# append()      在列表的尾部追加元素   s.append (10086)
# insert()      在指定索引之前，插入该元素   s.insert(0, 92)
# remove()      移除列表中第一个匹配到的值   s.remove (75)
# pop()     删除列表中指定索引位置的元素(如果未指定索引，默认删最后一个)会返回删除的元素(可以用变量定义出来)     s.pop (2) / s.pop()
# sort()    对列表进行排序(列表元素的数据类型一致，才可以进行排序)    s.sort()
# reverse()     反转列表元素(-1 -> 0 , 0 -> -1)   s.reverse()
# 不用硬敲,直接s.会直接出现这些

# 案例 将用户输入的 10 个数字,存储到一个列表中,输入其中的最小值,最大值和平均值
# 1 输入十个数字
# s = []
# for i in  range (1,11):# 明确有几位数字可以用for . in range()来代替
#     sz = float(input(f"请输入你的第{i}位数: "))
#     # 2 十个数字存储到列表中list
#     s.append(sz)
# # 3 最小值,最大值可以先排序,后输出 0 -1 位
# print(f"最小值为: {min(s)}")
# print(f"最大值为: {max(s)}")
#
# # 4 平均值可能就需要全部求和然后 / 10 了
# print(f"平均数为: {sum(s) / len(s)}.2f")

# s1 = [1, 2, 3, 4, 5, 6,...] s2 = [3, 4, 5, 6, 7,...]
# 可以进行解包(把容器里的元素一个一个全拆开) s3 = [*s1 + *s2]
# 也可以进行组包(s3 = s1 + s2 )
# 进行去重(复)
# 1 以一个新包进行去重 s0 = []
# for num in s3:
#    if num not in s0:
#       s0.append(num)
# 最后输出

# 生成1 - 20 的平方列表
# 生成一个装的列表
# num1 = []
# # 装进去
# for i in range(1,21):
#     num1.append(i ** 2)
# print(num1)
# num1 = [i ** 2 for i in range(1,21)]
# print(num1)

# # 列表中提取所有偶数,计算平方并组成新列表
# num_list = [19, 23, 54, 64, 87, 20, 109, 232, 123, 43, 26, 55, 72]
# num0 = [i ** 2 for i in num_list if i % 2 == 0]
# print(num0)

#合并如下三个列表，并对合并后的列表进行元素的去重，然后 排好序 后输出到控制台
# list1 = ['M','A','C','E','F','G','H','L','N','I','K','O']
# list2 = ['X','Z','T','Y','D','E','F','G']
# list3 = ['w', 'A', 'S', 'D']
# # 放进新的列表
# # list0 = []
# # list0 = [i for i in list1 + list2 + list3 if i not in list0]
# # print(list0)
# list0 = sorted(list(set(list1 + list2 + list3)))
# print(list0)

# 能被3 或 5整除的元素提出来,获取数对应的平方,做成新列表
list0 = [i ** 2 for i in range(1, 31) if i % 3 == 0 or i % 5 == 0]
print(list0)