# 字符串 基本操作 --->字符串是不可变的(无法修改)
# 可迭代(遍历)可以索引就像列表一样
# 可切片(同列表)

# 字符串操作常用方法
# find()    在字符串中查找子串，返回 第一次 出现的索引位置，找不到返回-1  s.find('Python')
# count()   统计子串在字符串中出现的次数  s.count('H')
# upper()   将字符串中的所有字母转换为大写     s.upper()
# lower()   将字符串中的所有字母转换为小写     s.lower()
# split()   将字符串按指定分隔符分割成列表     s.split('1)
# strip()   去除字符串两端的空白字符或指定字符   s.strip() / s.strip('*')
# replace()     将字符串中的指定子串替换为新的子串   s.replace('H','C')
# startswith()  检查字符串是否以指定子串开头，返回布尔值    s.startwith('P') s.endwith()以..结束
# 无论怎么样,这个字符串都不会改变.哪怕上面的方法都用了一遍之后最终输出都不会改变
# 只有重新定义修改之后的变量这个字符串才会改变

# 案例 邮箱格式验证: 用户输入一个邮箱,验证邮箱格式是否正确(包含一个@和至少一个.),如果输入正确,输出 邮箱格式正确 ,否则输出 邮箱格式错误
# 1 输入邮箱

# 2 判断格式是否正确,直接用if判断,太简单了,我直接再加一个循环算了,再加一个五次输入错误直接爆炸
# i = 0
# while i < 5:
#     yx = input("请输入你的邮箱: ")
#     gs1 = yx.count('.')
#     gs2 = yx.count('@')
#     if (gs1 == 1 and gs2 == 1):
#         print("邮箱格式正确")
#         break
#     else:
#         i += 1
#         print(f"邮箱格式错误{i}次")
# if i == 5:
#     print("都输错五次了还尼玛输呢")

i = 0
while i < 5:
    yx = input("请输入你的邮箱: ")
    if '@' not in yx or '.' not in yx:
        i += 1
        print(f"邮箱格式错误{i}次")
    else:
        print("邮箱格式正确")
        break
if i == 5:
    print("都输错五次了还尼玛输呢")

