# 全局变量:在函数之外定义的变量，称之为全局变量，在整个文件中(包括函数内)都可以使用(通常定义在文件的顶部)
# 局部变量:在函数内部定义的变量，称之为局部变量，只能在该函数内部使用，外部无法访问(函数执行完毕后，会自动销毁其内部局部变量)
# 全局变量,函数外边的,所有的地方都能调用的就是全局变量
# 局部变量,函数里面的,执行完自动销毁的就叫局部变量
# 局部变量只能在函数内部进行使用
# global 函数内部声明使用全局变量,要先声明,再使用
# 这样子函数调用完之后的全局变量num也会修改
# 尽量避免在函数中使用全局变量，因为会使代码难以维护和调试
# 考虑使用函数参数和返回值来传递数据，而不是依赖全局变量
# global主要用在程序的状态、配置和计数器等场景中

# 传参方式
# 1 位置传参 hs(name, age) hs(1, 18)位置必须一样,才能传入参数
# 2 关键字传参 hs(name, age) hs(age = 18, name = 1)可以不用在意位置
# 两种传参可以混用,需要保值关键字参数在位置参数之后的
# 参数少,顺序自然就合适使用位置参数
# 参数多,而且容易混淆的适合使用关键字传参

# 不定长传参.位置参数(*args) 这个是规范写法,实际上*a也可以 封装到元组当中
# 不定长传参.关键字传递(**kwargs) 封装到字典当中,通过字典的手段来查询里面的东西

# *args适用于处理数量不确定的数据(必选项,比如喝的奶茶)
# **kwargs适用于处理数量不确定的选项(可选项,比如我奶茶加不加料,多糖少糖

# 调用函数也可以像之前的一样做一个嵌套 hs(x, y, oper) oper 可以替换为任意的其他参数

# 匿名函数
# 函数逻辑比较简单(单行表达式)且只在一个地方使用时，可以考虑使用匿名函数，简化书写(通常作为高阶函数的参数使用)
# 匿名函数中可以返回结果，也可以不返回结果。返回结果时，不需要写return，表达式的运行结果就是要返回的结果。
add = lambda x,y:x+y
add(1, 2)
sc = lambda :print("-------------")
sc()



