# 面向对象（万物皆对象）:他把一个人/物的 特征 和功能打包到一起,是面向对象编程的基本单元
# 之前的特征(对象的属性)(成绩,姓名)也就是属性,功能呢就是之前在里面的打招呼(对象的方法)
# 类: 描述的是一组具有相同属性(特征),和方法(功能/行为)的模板
# 类名的命名规范,遵循大驼峰命名,每个单词的首字母都是大写,单词之间没有分隔符
# __dict__是python中用户自定义类实例的一个特殊属性,用于以字典形式存储对象的属性
# print(类名.__dict__) 会将对象中的所有属性以字典的形式输出出来
# 对象名 = 类名(), 对象名.属性名1 = 属性值1等等

# 前面不用管了
# 定义在类外面的称之为函数,类里面的函数称之为方法
# def __init__:初始化方法,对象创建后自动调用,主要用于设置对象的初始状态(设置对象属性)
# self:方法的第一个参数,表示当前创建的实例对象(给实例对象赋值的一个方法)
# 可以创建完之后开始赋值,变成字典,self.属性名 = 参数值
# 如果调用类里的方法,是对象在前,方法在后 小明.打招呼(),不是打招呼(小明)
class Xuexiao:
    def __init__(self, name, age):
        self.name = name
        self.age = age
    def dzh(self):#这里忘记加self了
        print(f"你好,我叫{self.name},今年{self.age}岁")
    def __str__(self):# 只输出字符串,参数只能由self,一个都不能多
        # return print(f"你好,我叫{self.name},今年{self.age}岁"),不能这么写,搞错了
        return f"我叫{self.name},{self.age}岁"# 这个是python自动叫的,只要我输入了print等函数
# 魔法方法是不需要我们手动调用的,python会再合适的时机自动调用,魔法方法是python中提供的以双下划线开头和结尾的特殊方法,用于定义类的特殊行为
# __eq__ 比较两个对象是否相等
# __lt__, __le__, __gt__, __ge__ 支持比较两个对象的大小(<,<=,>,>=)